app/views/posts/index.html.erb

            <div class = "post-comments-container">
                <%post.recent_comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 1], ["post_id", 2]]