app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 9]]
---
        <div class = "post-comments-container">
            <%@post.comments.each do |comment|%>