app/controllers/comments_controller.rb

  def destroy
    @comment = @post.comments.find(params[:id])

    if @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 14], ["id", 50], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 50]]

  def create
    @comment = Comment.new(comment_params)
    @comment.post = @post
    @comment.user = current_user

    if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["post_id", 14], ["text", "sfsdf"], ["created_at", "2023-10-20 07:14:21.375360"], ["updated_at", "2023-10-20 07:14:21.375360"]]