app/models/comment.rb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 9]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2023-10-14 14:46:34.534978"], ["id", 9]]
---
  def update_comment_counter
    post.update(comments_counter: post.comments.count)