app/models/like.rb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 7]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-10-14 11:23:50.547315"], ["id", 7]]
---
  def update_likes_counter
    post.update(likes_counter: post.likes.count)