app/models/post.rb

SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 17]]
---
  def update_postscounter_user
    author.update(posts_counter: author.posts.count)