app/models/post.rb

  def update_post_counter
    user.update(posts_counter: user.posts.count)
---
UPDATE "users" SET "posts_counter" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["posts_counter", 2], ["updated_at", "2023-10-14 10:15:49.516712"], ["id", 17]]